"espk" = "Apple-højttalerport";
"ispk" = "Indbygget";
"emic" = "Mikrofonport";
"imic" = "Indbygget";
"hdpn" = "Port til hovedtelefoner";
"lini" = "Port til linjeindgang";
"lino" = "Port til linjeudgang";
"spdi" = "Port til optisk digital ind";
"spdo" = "Port til optisk digital ud";
"pci " = "PCI-kort";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Netværksenhed";
"blue" = "Bluetooth";
"bluh" = "Bluetooth-hovedtelefoner";
"blus" = "Bluetooth-hovedsæt";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
